# Student Alcohol Consumption

### Introduction:

This time you will download a dataset from the UCI.

### Step 1. Import the necessary libraries

De nou, importam les llibreries <span style="color:#DF7401">**pandas**</span> i <span style="color:#DF7401">**numpy**</span>.

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from student-mat.csv

### Step 3. Assign it to a variable called df.

Importam el dataset i l'assignam a la variable _df_, tal com s'ha fet als exercicis anteriors.

In [2]:
df=pd.read_csv('data/student-mat.csv')

Visulitzem les primeres files.

In [3]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

### Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

Abans de modificar el dataframe el guardam a la variable *df_old*.

In [4]:
df_old=df

A continuació, volem quedar-nos només amb les primeres columnes del dataframe fins <span style="color:#B43104">'guardian'</span>, ja que la primera columna és <span style="color:#B43104">'school'</span>. Així, indicam fins quina columna volem el nou dataframe amb _loc_.

In [5]:
df=df.loc[:,:'guardian']
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father

### Step 5. Create a lambda function that captalize strings.

La funció _upper()_ converteix un string a majúscules fent 
```p
String.upper() .
```
Ara, cream una funció <span style="color:#088A29">**lambda**</span> anomenada _capitalize_ que permeti aplicar _upper_ a l'string fent: ```capitalize(String)```.

In [6]:
capitalize = lambda string : string.upper()

Provem la funció implementada.

In [7]:
capitalize('Eadem mutata resurgo')

'EADEM MUTATA RESURGO'

### Step 6. Capitalize both Mjob and Fjob

En aquest apartat pasarem les columnes <span style="color:#B43104">'Mjob'</span> i <span style="color:#B43104">'Fjob'</span> a majúscules, emprant la funció _capitalize_ implementada.

Primer, modificam els noms de les columnes amb la següent instrucció.

In [8]:
df.rename(columns = {'Mjob':capitalize('Mjob'),'Fjob':capitalize('Fjob')}, inplace=True)

Ara, aplicam _capitalize_ a cada un dels elements de les dues columnes. Per fer-ho, empram _applymap()_.

In [9]:
df[['MJOB','FJOB']].applymap(capitalize).head()

      MJOB      FJOB
0  AT_HOME   TEACHER
1  AT_HOME     OTHER
2  AT_HOME     OTHER
3   HEALTH  SERVICES
4    OTHER     OTHER

### Step 7. Print the last elements of the data set.

Vegem que ocorre si visualitzam les darreres files del dataset.

In [10]:
df.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,MJOB,FJOB,reason,guardian
390,MS,M,20,U,LE3,A,2,2,services,services,course,other
391,MS,M,17,U,LE3,T,3,1,services,services,course,mother
392,MS,M,21,R,GT3,T,1,1,other,other,course,other
393,MS,M,18,R,LE3,T,3,2,services,other,course,mother
394,MS,M,19,U,LE3,T,1,1,other,at_home,course,father

### Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and captalize Mjob and Fjob.

Com podem observar a l'**Step 7**, les columnes encara contenen la informació en minúscules. Això es deu a que no hem assignat la modificació al dataset _df_.

Per modificar el dataset hem d'assignar els nous valors a les columnes <span style="color:#B43104">'MJOB'</span> i <span style="color:#B43104">'FJOB'</span>, tal com segueix.

In [11]:
df[['MJOB','FJOB']]=df[['MJOB','FJOB']].applymap(capitalize)

Vegem les primeres files.

In [12]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,MJOB,FJOB,reason,guardian
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,course,mother
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,course,father
2,GP,F,15,U,LE3,T,1,1,AT_HOME,OTHER,other,mother
3,GP,F,15,U,GT3,T,4,2,HEALTH,SERVICES,home,mother
4,GP,F,16,U,GT3,T,3,3,OTHER,OTHER,home,father

### Step 9. Create a function called majority that return a boolean value to a new column called legal_drinker

Per realitzar l'**Step 9** suposarem que l'edat mínima per beure alcohol al lloc on s'han recollit les dades és 18 anys.

La instrucció

```p
df['age']>=18
```

torna un vector ```TRUE-FALSE``` segons si el valor en  <span style="color:#B43104">'age'</span> és major o igual a 18 o no, és a dir, segons si la persona beu legalment o no.

D'aquesta manera, per crear la funció _majority()_ basta assignar aquest vector a una nova columna: <span style="color:#B43104">'legal_drinker'</span>.

In [13]:
def majority(df): df['legal_drinker'] = df['age']>=18

Apliquem la nova funció al dataframe _df_ i visualitzem les primeres observacions.

In [14]:
majority(df)
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,MJOB,FJOB,reason,guardian,legal_drinker
0,GP,F,18,U,GT3,A,4,4,AT_HOME,TEACHER,course,mother,True
1,GP,F,17,U,GT3,T,1,1,AT_HOME,OTHER,course,father,False
2,GP,F,15,U,LE3,T,1,1,AT_HOME,OTHER,other,mother,False
3,GP,F,15,U,GT3,T,4,2,HEALTH,SERVICES,home,mother,False
4,GP,F,16,U,GT3,T,3,3,OTHER,OTHER,home,father,False

### Step 10. Multiply every number of the dataset by 10. 
##### I know this makes no sense, don't forget it is just an exercise

Donat que només volem multiplicar els nombres que apareixen en el dataset, vegem quins tipus de valors tenim a cada columna.

In [15]:
df.dtypes

school           object
sex              object
age               int64
address          object
famsize          object
Pstatus          object
Medu              int64
Fedu              int64
MJOB             object
FJOB             object
reason           object
guardian         object
legal_drinker      bool
dtype: object

Així, tenim que tots els nombres són ```int64``` . Per tant, podem crear un vector de valors booleans que sigui ```TRUE``` quan la columna pertanyi a aquest tipus fent

```p
df.dtypes=='int64'.
```

Assignam les noves columnes $\cdot 10$ a _df_ i visualitzam les primeres observacions.

In [16]:
df.loc[:,df.dtypes=='int64']=10*df.loc[:,df.dtypes=='int64']
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,MJOB,FJOB,reason,guardian,legal_drinker
0,GP,F,180,U,GT3,A,40,40,AT_HOME,TEACHER,course,mother,True
1,GP,F,170,U,GT3,T,10,10,AT_HOME,OTHER,course,father,False
2,GP,F,150,U,LE3,T,10,10,AT_HOME,OTHER,other,mother,False
3,GP,F,150,U,GT3,T,40,20,HEALTH,SERVICES,home,mother,False
4,GP,F,160,U,GT3,T,30,30,OTHER,OTHER,home,father,False